balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF27J13.PIC
      <edc:DCRDef edc:access="------nn" edc:cname="CONFIG4H" edc:default="0xf3" edc:desc="" edc:impl="0x3" edc:name="CONFIG4H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xf3">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WPDIS" edc:desc="Write Protect Disable bit" edc:mask="0x1" edc:name="WPDIS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WPFP&lt;6:0&gt;/WPEND region ignored" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WPFP&lt;6:0&gt;/WPEND region erase/write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPEND" edc:desc="Write/Erase Protect Region Select bit (valid when WPDIS = 0)" edc:mask="0x1" edc:name="WPEND" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="PAGE_WPFP" edc:desc="Pages WPFP&lt;6:0&gt; through Configuration Words erase/write protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PAGE_0" edc:desc="Pages 0 through WPFP&lt;6:0&gt; erase/write protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="" edc:ishidden="true" edc:mask="0xf" edc:name="RESERVED" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:cname="RESERVED" edc:desc="RESERVED" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:WORMHoleSector>
    <edc:TestZone edc:beginaddr="0x200000" edc:endaddr="0x200400" edc:regionid="testmem"/>
    <edc:ConfigWORMSector edc:beginaddr="0x300000" edc:endaddr="0x300007" edc:regionid="cfgwormmem"/>
    <edc:DeviceIDSector edc:beginaddr="0x3ffffe" edc:endaddr="0x400000" edc:mask="0xffe0" edc:regionid="devid" edc:value="0x5B60"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x200028" edc:endaddr="0x200038" edc:regionid="debug"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:endaddr="0x1000">
    <edc:RegardlessOfMode>
      <edc:DPRDataSector edc:bank="0x0" edc:beginaddr="0x60" edc:endaddr="0x100" edc:regionid="gpr0"/>
      <edc:DPRDataSector edc:bank="0x1" edc:beginaddr="0x100" edc:endaddr="0x200" edc:regionid="gpr1"/>
      <edc:DPRDataSector edc:bank="0x2" edc:beginaddr="0x200" edc:endaddr="0x300" edc:regionid="gpr2"/>
      <edc:DPRDataSector edc:bank="0x3" edc:beginaddr="0x300" edc:endaddr="0x400" edc:regionid="gpr3"/>
      <edc:DPRDataSector edc:bank="0x4" edc:beginaddr="0x400" edc:endaddr="0x500" edc:regionid="gpr4"/>
      <edc:DPRDataSector edc:bank="0x5" edc:beginaddr="0x500" edc:endaddr="0x600" edc:regionid="gpr5"/>
      <edc:DPRDataSector edc:bank="0x6" edc:beginaddr="0x600" edc:endaddr="0x700" edc:regionid="gpr6"/>
      <edc:DPRDataSector edc:bank="0x7" edc:beginaddr="0x700" edc:endaddr="0x800" edc:regionid="gpr7"/>
      <edc:DPRDataSector edc:bank="0x8" edc:beginaddr="0x800" edc:endaddr="0x900" edc:regionid="gpr8"/>
      <edc:DPRDataSector edc:bank="0x9" edc:beginaddr="0x900" edc:endaddr="0xa00" edc:regionid="gpr9"/>
      <edc:DPRDataSector edc:bank="0xa" edc:beginaddr="0xa00" edc:endaddr="0xb00" edc:regionid="gpr10"/>
      <edc:DPRDataSector edc:bank="0xb" edc:beginaddr="0xb00" edc:endaddr="0xc00" edc:regionid="gpr11"/>
      <edc:DPRDataSector edc:bank="0xc" edc:beginaddr="0xc00" edc:endaddr="0xd00" edc:regionid="gpr12"/>
      <edc:DPRDataSector edc:bank="0xd" edc:beginaddr="0xd00" edc:endaddr="0xe00" edc:regionid="gpr13"/>
      <edc:DPRDataSector edc:bank="0xe" edc:beginaddr="0xe00" edc:endaddr="0xeb0" edc:regionid="gpr14"/>
      <edc:SFRDataSector edc:bank="0xe" edc:beginaddr="0xeb0" edc:endaddr="0xf00" edc:regionid="sfr14">
        <edc:AdjustPoint edc:offset="8"/>
        <edc:SFRDef edc:access="------nn" edc:cname="ADCTRIG" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="ADCTRIG" edc:nzwidth="8" edc:por="------00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRIGSEL" edc:desc="" edc:mask="0x3" edc:name="TRIGSEL" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SRC0" edc:desc="" edc:mask="0x1" edc:name="SRC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRC1" edc:desc="" edc:mask="0x1" edc:name="SRC1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TRIGSEL0" edc:desc="" edc:mask="0x1" edc:name="TRIGSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRIGSEL1" edc:desc="" edc:mask="0x1" edc:name="TRIGSEL1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SRC" edc:desc="" edc:mask="0x3" edc:name="SRC" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMDIS0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PMDIS0" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PD0"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI1MD" edc:desc="" edc:mask="0x1" edc:name="SPI1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI2MD" edc:desc="" edc:mask="0x1" edc:name="SPI2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UART1MD" edc:desc="" edc:mask="0x1" edc:name="UART1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UART2MD" edc:desc="" edc:mask="0x1" edc:name="UART2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCP1MD" edc:desc="" edc:mask="0x1" edc:name="ECCP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCP2MD" edc:desc="" edc:mask="0x1" edc:name="ECCP2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCP3MD" edc:desc="" edc:mask="0x1" edc:name="ECCP3MD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PMDMSSP1" edc:desc="" edc:mask="0x1" edc:name="PMDMSSP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDMSSP2" edc:desc="" edc:mask="0x1" edc:name="PMDMSSP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDUART1" edc:desc="" edc:mask="0x1" edc:name="PMDUART1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDUART2" edc:desc="" edc:mask="0x1" edc:name="PMDUART2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDECCP1" edc:desc="" edc:mask="0x1" edc:name="PMDECCP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDECCP2" edc:desc="" edc:mask="0x1" edc:name="PMDECCP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDECCP3" edc:desc="" edc:mask="0x1" edc:name="PMDECCP3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PMDADC" edc:desc="" edc:mask="0x1" edc:name="PMDADC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDMSSP" edc:desc="" edc:mask="0x3" edc:name="PMDMSSP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PMDUART" edc:desc="" edc:mask="0x3" edc:name="PMDUART" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PMDECCP" edc:desc="" edc:mask="0x7" edc:name="PMDECCP" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SPIMD" edc:desc="" edc:mask="0x3" edc:name="SPIMD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="UARTMD" edc:desc="" edc:mask="0x3" edc:name="UARTMD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ECCPMD" edc:desc="" edc:mask="0x7" edc:name="ECCPMD" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnn-" edc:cname="PMDIS1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000-" edc:name="PMDIS1" edc:nzwidth="8" edc:por="-000000-">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PD1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMR1MD" edc:desc="" edc:mask="0x1" edc:name="TMR1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR2MD" edc:desc="" edc:mask="0x1" edc:name="TMR2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3MD" edc:desc="" edc:mask="0x1" edc:name="TMR3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR4MD" edc:desc="" edc:mask="0x1" edc:name="TMR4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTCCMD" edc:desc="" edc:mask="0x1" edc:name="RTCCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMUMD" edc:desc="" edc:mask="0x1" edc:name="CTMUMD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PMDTMR1" edc:desc="" edc:mask="0x1" edc:name="PMDTMR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDTMR2" edc:desc="" edc:mask="0x1" edc:name="PMDTMR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDTMR3" edc:desc="" edc:mask="0x1" edc:name="PMDTMR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDTMR4" edc:desc="" edc:mask="0x1" edc:name="PMDTMR4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PMDTMR" edc:desc="" edc:mask="0xf" edc:name="PMDTMR" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="PMDRTCC" edc:desc="" edc:mask="0x1" edc:name="PMDRTCC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDCTMU" edc:desc="" edc:mask="0x1" edc:name="PMDCTMU" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMRMD" edc:desc="" edc:mask="0xf" edc:name="TMRMD" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-n-nnnnn" edc:cname="PMDIS2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0-00000" edc:name="PMDIS2" edc:nzwidth="8" edc:por="-0-00000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PD2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP3MD" edc:desc="" edc:mask="0x1" edc:name="CMP3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5MD" edc:desc="" edc:mask="0x1" edc:name="TMR5MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR6MD" edc:desc="" edc:mask="0x1" edc:name="TMR6MD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMR8MD" edc:desc="" edc:mask="0x1" edc:name="TMR8MD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PMDCMP1" edc:desc="" edc:mask="0x1" edc:name="PMDCMP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDCMP2" edc:desc="" edc:mask="0x1" edc:name="PMDCMP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDCMP3" edc:desc="" edc:mask="0x1" edc:name="PMDCMP3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PMDCMP" edc:desc="" edc:mask="0x7" edc:name="PMDCMP" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="PMDTMR5" edc:desc="" edc:mask="0x1" edc:name="PMDTMR5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PMDTMR6" edc:desc="" edc:mask="0x1" edc:name="PMDTMR6" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PMDTMR8" edc:desc="" edc:mask="0x1" edc:name="PMDTMR8" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CMPMD" edc:desc="" edc:mask="0x7" edc:name="CMPMD" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
