balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF27J13.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCP3CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CCP3CON" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP3M" edc:desc="" edc:mask="0xf" edc:name="CCP3M" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="DC3B" edc:desc="" edc:mask="0x3" edc:name="DC3B" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="P3M" edc:desc="" edc:mask="0x3" edc:name="P3M" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP3M0" edc:desc="" edc:mask="0x1" edc:name="CCP3M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3M1" edc:desc="" edc:mask="0x1" edc:name="CCP3M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3M2" edc:desc="" edc:mask="0x1" edc:name="CCP3M2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3M3" edc:desc="" edc:mask="0x1" edc:name="CCP3M3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC3B0" edc:desc="" edc:mask="0x1" edc:name="DC3B0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC3B1" edc:desc="" edc:mask="0x1" edc:name="DC3B1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3M0" edc:desc="" edc:mask="0x1" edc:name="P3M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3M1" edc:desc="" edc:mask="0x1" edc:name="P3M1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR3L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR3L" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCPR3L" edc:desc="" edc:mask="0xff" edc:name="CCPR3L" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR3H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR3H" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCPR3H" edc:desc="" edc:mask="0xff" edc:name="CCPR3H" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP3DEL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP3DEL" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P3DC" edc:desc="" edc:mask="0x7f" edc:name="P3DC" edc:nzwidth="7"/>
              <edc:SFRFieldDef edc:cname="P3RSEN" edc:desc="" edc:mask="0x1" edc:name="P3RSEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="P3DC0" edc:desc="" edc:mask="0x1" edc:name="P3DC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3DC1" edc:desc="" edc:mask="0x1" edc:name="P3DC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3DC2" edc:desc="" edc:mask="0x1" edc:name="P3DC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3DC3" edc:desc="" edc:mask="0x1" edc:name="P3DC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3DC4" edc:desc="" edc:mask="0x1" edc:name="P3DC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3DC5" edc:desc="" edc:mask="0x1" edc:name="P3DC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3DC6" edc:desc="" edc:mask="0x1" edc:name="P3DC6" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ECCP3AS" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ECCP3AS" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSS3BD" edc:desc="" edc:mask="0x3" edc:name="PSS3BD" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PSS3AC" edc:desc="" edc:mask="0x3" edc:name="PSS3AC" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="ECCP3AS" edc:desc="" edc:mask="0x7" edc:name="ECCP3AS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ECCP3ASE" edc:desc="" edc:mask="0x1" edc:name="ECCP3ASE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSS3BD0" edc:desc="" edc:mask="0x1" edc:name="PSS3BD0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS3BD1" edc:desc="" edc:mask="0x1" edc:name="PSS3BD1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS3AC0" edc:desc="" edc:mask="0x1" edc:name="PSS3AC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSS3AC1" edc:desc="" edc:mask="0x1" edc:name="PSS3AC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCP3AS0" edc:desc="" edc:mask="0x1" edc:name="ECCP3AS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCP3AS1" edc:desc="" edc:mask="0x1" edc:name="ECCP3AS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ECCP3AS2" edc:desc="" edc:mask="0x1" edc:name="ECCP3AS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
