balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF27J13.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="PORTB" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB2" edc:desc="" edc:mask="0x1" edc:name="RB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB3" edc:desc="" edc:mask="0x1" edc:name="RB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB4" edc:desc="" edc:mask="0x1" edc:name="RB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB5" edc:desc="" edc:mask="0x1" edc:name="RB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB6" edc:desc="" edc:mask="0x1" edc:name="RB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB7" edc:desc="" edc:mask="0x1" edc:name="RB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RB" edc:desc="" edc:mask="0xff" edc:name="RB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="AN12" edc:desc="" edc:mask="0x1" edc:name="AN12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN10" edc:desc="" edc:mask="0x1" edc:name="AN10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN8" edc:desc="" edc:mask="0x1" edc:name="AN8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AN9" edc:desc="" edc:mask="0x1" edc:name="AN9" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="KBI2" edc:desc="" edc:mask="0x1" edc:name="KBI2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="KBI3" edc:desc="" edc:mask="0x1" edc:name="KBI3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="INT0" edc:desc="" edc:mask="0x1" edc:name="INT0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CTED1" edc:desc="" edc:mask="0x1" edc:name="CTED1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTED2" edc:desc="" edc:mask="0x1" edc:name="CTED2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="KBI0" edc:desc="" edc:mask="0x1" edc:name="KBI0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="KBI1" edc:desc="" edc:mask="0x1" edc:name="KBI1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PGC" edc:desc="" edc:mask="0x1" edc:name="PGC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PGD" edc:desc="" edc:mask="0x1" edc:name="PGD" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="RP3" edc:desc="" edc:mask="0x1" edc:name="RP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTCC" edc:desc="" edc:mask="0x1" edc:name="RTCC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RP9" edc:desc="" edc:mask="0x1" edc:name="RP9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP10" edc:desc="" edc:mask="0x1" edc:name="RP10" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:SFRFieldDef edc:cname="C3IND" edc:desc="" edc:mask="0x1" edc:name="C3IND" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3INC" edc:desc="" edc:mask="0x1" edc:name="C3INC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2INC" edc:desc="" edc:mask="0x1" edc:name="C2INC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SCL2" edc:desc="" edc:mask="0x1" edc:name="SCL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SDA2" edc:desc="" edc:mask="0x1" edc:name="SDA2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RP4" edc:desc="" edc:mask="0x1" edc:name="RP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REFO" edc:desc="" edc:mask="0x1" edc:name="REFO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP6" edc:desc="" edc:mask="0x1" edc:name="RP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP7" edc:desc="" edc:mask="0x1" edc:name="RP7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP8" edc:desc="" edc:mask="0x1" edc:name="RP8" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.5">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP5" edc:desc="" edc:mask="0x1" edc:name="RP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3INA" edc:desc="" edc:mask="0x1" edc:name="C3INA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4" edc:desc="" edc:mask="0x1" edc:name="CCP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5" edc:desc="" edc:mask="0x1" edc:name="CCP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6" edc:desc="" edc:mask="0x1" edc:name="CCP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7" edc:desc="" edc:mask="0x1" edc:name="CCP7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
